import React from 'react'

const TIL0604 = () => {
    return (
        <div className='BlogDaily'>
            <h3>Audit & 사용자 보호</h3>
            <h4>Audit: 감사(audit)</h4>
            <h4>Audit: 스마트 컨트랙트 테스트 기법</h4>
            <h4>사용자 보호: 지갑 보안과 개인 키 관리</h4>
            <h4>사용자 보호: 하드웨어 지갑</h4>
            <h4>사용자 보호: 피싱, 사기 방지</h4>
            <h4>사용자 보호: 트랜잭션 사전 검토 기능</h4>

            <pre><code>{`
강의 노트 

오딧은 마치 4년마다 받는 자동차 종합검사 받는 것과 같음 
오딧 비용 비쌈 - 작은 프로젝트면 5000 달러 정도 

사용자 보호 - 유저를 어떻게 교육할 것인가?

바이낸스 아카데미 - 이런 서비스가 우리 프로젝트에서 필요할 수도 있다 

경고문구는 꼭 필요하다 - 미움받지 않기 위해서 
`}</code></pre>

        </div>
    )
}

export default TIL0604