import React from 'react'

const Introduction = () => {
  return (
    <div className='Introduction'>
      <h3>비트코인의 탄생 배경</h3>
      <p>2025년 2월 3일 </p>

      <h4>블록체인이란?</h4>
      데이터가 해시값으로 블록에 기록되어 있고 블록들이 시간 순서대로 연결되어 있는 것.

      <h4>블록체인이 만들어진 배경은?</h4>
      89년, 한 연구자의 연구 결과가 조작된 것이라는 스캔들을 본 과학자 스콧 스토네타가 디지털 기록의 중요성을 절감했고, 암호학자인 스튜어트 하버와 함께 디지털 기록의 불변성에 대한 공동
      연구를 해 만들었다. 그들이 만든 블록체인의 기본 메커니즘은 데이터 전체가 아닌 해시값만 전송해서 타임스탬프를 부여받고 이를 디지털 서명으로 보증받는다는 것이었다.

      <h4>비트코인은 화폐일까?</h4>
      다음 화폐 3대 요소를 갖추고 있는지를 기준으로 살펴보자.
      <ol>
        <li>교환의 매개체: 아직 대부분의 사람들은 실생활에서 비트코인을 사용해 교환/거래 하지 않는다.</li>
        <li>가치 척도의 기능: 스테이블 코인의 등장으로 가치 척도가 어느정도 가능해졌지만 여전히 높은 가격 변동성으로 인해 가치 척도의 기능을 온전히 해내기 어렵다.</li>
        <li>가치 저장의 기능: 비트코인이 이 기능은 현재 가지고 있다. 이미 일부 국가에서는 법정화폐를 대신해 사용되기 시작했다.</li>
      </ol>
      여기서 블록체인 엔지니어로서 고민할 부분을 찾을 수 있다.
      <ul>
        <li>마트에서 비트코인으로 계산하기 어려운데 사용성을 향상할 방법은?</li>
        <li>가치 척도의 기능으로서의 한계를 극복할 방법은?</li>
      </ul>
      <h4>새 기술은 문제 해결을 위해 태어난다. 비트코인은 어떤 문제 해결을 위해 태어났을까?</h4>
      2000년대 IT 버블 붕괴, 아프간/이라크 전쟁 등으로 미국 경기가 약화되지 미국은 초 저금리 정책을 펼쳐 대응한다. 부동산 가격이 상승하기 시작했고 금융사는 신용 등급이 낮은
      사람에게도 주택 담보 대출을 해주기 시작했다. 2004년, 미국 경제가 회복세에 들어가면서 초 저금리 정책을 종료했고 부동산 버블이 터지면서 엮여있는 금융사들이 파산하기 시작했고 이는
      세계 금융 위기로 이어졌다.
      금융 위기에 대한 정부의 대응책은 양적 완화였다. 화폐를 계속 찍어 신용창출을 하며 경제 위기를 해결했지만, 자산 버블, 인플레이션, 부의 양극화, 금융 불안정, 신흥국의 외환위기 위험
      증가 등의 부작용을 남겼다.
      <br />
      반면 개인정보 관련 정부와 대기업의 행보에 반해 개인의 프라이버시를 중요시하는 사람들이 ‘시이퍼 펑크’라는 단체를 만들어 탈 중앙화된 문화를 옹호하는 사회운동을 시작했다.
      사토시 나카모토의 비트코인 백서는 사이버 펑크에 보낸 이메일를 통해 처음 세상에 선보이게 되었고, 사토시는 사이버 펑크 멤버들과 소통하며 비트코인 개발한다. <br />
      <br />비트코인의 탄생 목적은 제네시스 블록에 기록되어 있다:<br />
      <p>The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.</p>
      이는 금융위기에서 영국 정부의 은행 구제금융에 대한 비판적 메세지로 다음과 같은 비트코인 탄생 목적을 말하고 있다:
      <ol>
        <li>중앙화 금융 시스템의 블안정성과 문제점 비판</li>
        <li>탈중앙화 금융의 대안 제시</li>
      </ol>
      블록체인은 디지털 세상에서 데이터의 신뢰를 만들어내는 신뢰의 기술이다.
      <br/>
      나만의 문제 인식과 그 해결을 위한 블록체인 활용법에 대해 스케치 하며 공부해보자.


    </div>
  )
}

export default Introduction



